{
    "Born": "( 1724-04-22 ) 22 April 1724 Knigsberg ,  Kingdom of Prussia (present-day  Kaliningrad ,  Russia )",
    "Died": "12 February 1804 (1804-02-12)  (aged79) Knigsberg ,  East Prussia ,  Kingdom of Prussia",
    "Nationality": "Prussian",
    "Education": "Collegium Fridericianum University of Knigsberg ( B.A. ;  M.A. , April 1755;  PhD , September 1755; PhD,   August 1770)",
    "Era": "Age of Enlightenment",
    "Region": "Western philosophy",
    "School": "Kantianism Enlightenment philosophy German idealism  Foundationalism  Metaphysical conceptualism  Perceptual non-conceptualism   Transcendental idealism Empirical realism Indirect realism  Correspondence theory of truth   Liberal naturalism  Kantian ethics Classical liberalism",
    "Institutions": "University of Knigsberg",
    "Theses": "Principiorum primorum cognitionis metaphysicae nova dilucidatio (A New Elucidation of the First Principles of Metaphysical Cognition)  (September 1755) De mundi sensibilis atque intelligibilis forma et principiis (Dissertation on the Form and Principles of the Sensible and the Intelligible World)  (August 1770)",
    "AcademicAdvisors": "Martin Knutzen ,  Johann Gottfried Teske  (M.A. advisor),  Konrad Gottlieb Marquardt ",
    "NotableStudents": "Jakob Sigismund Beck ,  Johann Gottlieb Fichte ,  Johann Gottfried Herder",
    "Language": "German",
    "MainInterests": "Epistemology Metaphysics Ethics Aesthetics Cosmogony",
    "NotableIdeas": "Abstractconcrete distinction  Aesthetic  teleological judgments Analyticsynthetic distinction Categorical  and  hypothetical imperative Categories Cosmotheology Critical philosophy Copernican revolution  in philosophy Disinterested delight Empirical realism Kant's antinomies Kant's pitchfork Kingdom of Ends Mathematical vs. dynamical  sublimity  Nebular hypothesis Noogony  and  noology Noumenon  vs.  thing-in-itself Ontotheology Primacy of  practical reason  Public reason Rechtsstaat Sapere aude Transcendental schema Theoretical  vs.  practical philosophy Transcendental idealism Transcendental theology Understandingreason distinction",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Kant_gemaelde_3.jpg/220px-Kant_gemaelde_3.jpg"
}