{
    "Born": "Werner Karl Heisenberg ( 1901-12-05 ) 5 December 1901 Wrzburg ,  Kingdom of Bavaria ,  German Empire",
    "Died": "1 February 1976 (1976-02-01)  (aged74) Munich , Bavaria,  West Germany",
    "RestingPlace": "Munich Waldfriedhof",
    "Nationality": "German",
    "AlmaMater": "University of Munich University of Gttingen",
    "KnownFor": "Uncertainty principle Copenhagen interpretation Heisenberg cut Heisenberg's entryway to matrix mechanics Heisenberg ferromagnet Heisenberg group Heisenberg limit Heisenberg's microscope Heisenberg model (classical) Heisenberg model (quantum) Heisenberg picture HeisenbergLangevin equations Euler-Heisenberg Lagrangian Kramers-Heisenberg formula Isospin Matrix mechanics Bootstrap model C*-algebra Exchange force Exchange interaction Electron hole theory Mott problem Quantum fluctuation Quantum spacetime Resonance (chemistry) S-matrix S-matrix theory Protonneutron model of the nucleus Vacuum polarization Wave function collapse Uranprojekt",
    "Spouse(S)": "Elisabeth Schumacher ( m.  1937 )",
    "Children": "7 (incl.  Jochen  and  Martin )",
    "Awards": "Matteucci Medal   (1929) Barnard Medal for Meritorious Service to Science   (1930) Nobel Prize in Physics   (1932) Max Planck Medal   (1933) Foreign Member of the Royal Society   (1955)  Foreign Associate of the National Academy of Sciences   (1961)",
    "Fields": "Theoretical physics",
    "Institutions": "University of Gttingen University of Copenhagen University of Leipzig University of Berlin University of Munich",
    "Thesis": "On stability and turbulence of liquid flows  (1923)",
    "DoctoralAdvisor": "Arnold Sommerfeld",
    "OtherAcademicAdvisors": "Niels Bohr Max Born",
    "DoctoralStudents": "Felix Bloch Edward Teller Rudolf E. Peierls Reinhard Oehme Friedwardt Winterberg Peter Mittelstaedt erban ieica Ivan Supek Erich Bagge Hermann Arthur Jahn Heimo Dolch Hans Heinrich Euler Edwin Gora Bernhard Kockel Arnold Siegert Wang Foh-san Karl Ott Bary F. Malik",
    "OtherNotableStudents": "William Vermillion Houston Guido Beck Ugo Fano Ettore Majorana Herbert Wagner",
    "Influenced": "Robert Dpel Carl Friedrich von Weizscker",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Bundesarchiv_Bild183-R57262%2C_Werner_Heisenberg.jpg/220px-Bundesarchiv_Bild183-R57262%2C_Werner_Heisenberg.jpg"
}